Revit 2027 API
ParameterTypeId.StairsTrisertypeTreadMaterial Property
 "Tread Material"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsTrisertypeTreadMaterial { get; }
Public Shared ReadOnly Property StairsTrisertypeTreadMaterial As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsTrisertypeTreadMaterial {
	ForgeTypeId^ get ();
}
static member StairsTrisertypeTreadMaterial : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace